<a href="https://colab.research.google.com/github/nugi1209/Virtual_Experience_KPMG_Data_Analytics/blob/master/KPMG_Virtual_Experience_2_Nugroho_Budianggoro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd
import seaborn as sns
import matplotlib

In [14]:
url = "https://github.com/nugi1209/Virtual_Experience_KPMG_Data_Analytics/blob/master/KPMG_VI_New_raw_data_update_final.xlsx?raw=true"
xls = pd.ExcelFile(url)

In [15]:
xls.sheet_names

['Title Sheet',
 'Transactions',
 'NewCustomerList',
 'CustomerDemographic',
 'CustomerAddress']

In [16]:
df_tr = pd.read_excel(url, sheet_name = 1, header = 1)
df_tr.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [17]:
df_nc = pd.read_excel(url, sheet_name = 2, header = 1)
df_nc.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [18]:
df_cd = pd.read_excel(url, sheet_name = 3, header = 1)
df_cd.columns
df_cd.head()

   customer_id      first_name  ... owns_car tenure
0            1         Laraine  ...      Yes   11.0
1            2             Eli  ...      Yes   16.0
2            3           Arlin  ...      Yes   15.0
3            4          Talbot  ...       No    7.0
4            5  Sheila-kathryn  ...      Yes    8.0

[5 rows x 13 columns]

In [19]:
df_ca = pd.read_excel(url, sheet_name = 4, header = 1)
df_ca.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

TRANSACTIONS

In [20]:
df_tr = df_tr.groupby(["customer_id"], as_index = False).sum()
df_tr["profit_per_customer"] = df_tr["list_price"] - df_tr['standard_cost']
df_tr.head()

   customer_id  transaction_id  ...  product_first_sold_date  profit_per_customer
0            1          126342  ...                 410455.0              3018.09
1            2           25415  ...                 116327.0              2226.26
2            3          110741  ...                 314802.0              3362.81
3            4           27089  ...                  72017.0               220.57
4            5           47818  ...                 224166.0              2394.94

[5 rows x 8 columns]

In [21]:
keep_cols1 = ["customer_id", "profit_per_customer"]
df_tr = df_tr[keep_cols1]
df_tr.head()

   customer_id  profit_per_customer
0            1              3018.09
1            2              2226.26
2            3              3362.81
3            4               220.57
4            5              2394.94

In [25]:
df_cst = pd.merge(df_cd,df_ca, how="inner", on=["customer_id"])
keep_cols2 = ["gender", 
              'past_3_years_bike_related_purchases', 
              "DOB",
              "job_title",
              "job_industry_category",
              "wealth_segment",
              "owns_car",
              "tenure",
              "postcode",
              "state",
              "property_valuation"]

df_cst = df_cst[keep_cols2]

df_cst.head()

   gender  ...  property_valuation
0       F  ...                  10
1    Male  ...                  10
2    Male  ...                   9
3  Female  ...                   4
4    Male  ...                   9

[5 rows x 11 columns]